Revit 2027 API
ViewDisplayModel.SmoothEdges Property
 True to enable "smooth edge" (anti-aliasing) effect. False to disable it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SmoothEdges { get; set; }
Public Property SmoothEdges As Boolean
	Get
	Set
public:
property bool SmoothEdges {
	bool get ();
	void set (bool value);
}
member SmoothEdges : bool with get, set
Property Value
Boolean
See Also
Reference
ViewDisplayModel Class
Autodesk.Revit.DB Namespace